
import UIKit



//: # 1️⃣ السؤال الاول
/*:

  ## ستقوم بعمل Function يقوم بحساب BMI
 
 #
1.1) قم بكتابة ثلاثة متغيرات
 #
 الأول يحتوي على قيمة الطول
 #الثاني عبارة عن الوزن
 #الثالث عبارة عن BMI
 
 #
 1.2)  قم بكتابة دالة تحتوي على معادلة لحساب الـ BMI
 #
 1.3) قم بكتابة داخل الدالة أمر Print لطباعة الـ BMI بعد حسابه.
 #
 تكون طريقه الطباعه باستمعال الif-Statment  لتحقيق الشروط الثالية
 #
 اقل من 18.5 -> ضعيف
 #
 18.5- 30.0 -> وزن طبيعي
 #
  30.1- 40.0 -> سمنة خفيفه
 #
 اكثر من 40 -> سمنة مفرطه
*/
var height = 1.65
var weight = 73.0

func bmi (height: Double, weight: Double) -> String {
    
 let bmiEq = weight / (height * height)
    
    print(bmiEq)
    
    if bmiEq < 18.5 {
        return "ضعيف"
    }else if bmiEq >= 18.5 && bmiEq <= 30.0 {
        return "وزن طبيعي"
        
    }else if bmiEq >= 31.0 && bmiEq <= 40.0{
        return "سمنة خفيفة"
        
    }else {
        return "سمنة مفرطه"
    }
    
}
 
var randomBmi = bmi(height: height, weight: weight)
print(randomBmi)



//: # 2️⃣  السؤال الثاني

/*:
  ## سوف تقوم بعمل دالة تقوم بالكشف اذا كان المُتقدم يستحق رخصة القيادة أم لا.
##
2.1) قم بكتابة متغيرين الأول يرمز لأسم المتقدم و المتغير الثاني لعمر المتقدم.
 ##
 2.2) - قم بكتابة دالة تحتوي على parameters لإدخال اسم المتقدم و عمر المتقدم.
 ##
 2.3) قم بإنشاء If statement لمقارنة عمر المتقدم مع شروط التقديم
 ##
  #
 مثلًا اذا كان عمر المتقدم تحت ١٨ سوف يتم طباعة نص بأن المتقدم لم يكمل العُمر المطلوب
  #
 و اذا كان فوق ١٨ سوف يتم طباعة نص بأن المتقدم يُسمح له بإمتلاك رخصة قيادة
*/
var name = "فرح"
var age = 17

func DrivingLicenses (name a:String, age b:Int) {
    if age >= 18{
        print("لقد تم ارسال طلب رخصة قيادة ل\(name) بنجاح")
    }
    else {
        print("نعتذر \(name) لا يسمح لك بتقديم طلب لرخصة قيادة و ذلك بسبب عدم اكتمالك للسن المطلوب")
    }
}
DrivingLicenses(name:name, age: age)
